import Header from "../../components/Header/Header";
import Footer from "../../components/Footer/Footer";

const PrivacyPolicy = () => {
    return (
        <div>
          <Header />
<main className="flex-shrink-0">
  <div className="container">
    <h1 className="mt-5">Політика конфеденційності</h1>
    <p className="lead">Ця Політика конфіденційності пояснює, як Freelansehub збирає, використовує, зберігає та захищає персональні дані користувачів при використанні нашого веб-застосунку.</p>
    <h1 className="mt-5">1. Яку інформацію ми збираємо</h1>
    <p className="lead">Ми можемо збирати такі дані:</p>
    <p className="lead">- Реєстраційні дані: Ім'я, прізвище, email, номер телефону, логін та пароль.</p>
    <p className="lead">- Дані профілю: Інформація про ваш профіль, включаючи фотографії, резюме, навички та досвід роботи.</p>
    <p className="lead">- Дані про активність: Інформація про вашу активність на платформі, включаючи перегляди профілів, відгуки та коментарі.</p>
    <p className="lead">- Фінансові дані: Інформація про ваші фінансові транзакції, включаючи платіжні реквізити та історію платежів.</p>
    <h1 className="mt-5">2. Як ми використовуємо вашу інформацію</h1>
    <p className="lead">Ми використовуємо вашу інформацію для:</p>
    <p className="lead">- Надання послуг: Для створення та управління вашим профілем, а також для забезпечення функціонування платформи.</p>
    <p className="lead">- Комунікації: Для зв'язку з вами, надсилання важливих повідомлень та оновлень.</p>
    <p className="lead">- Персоналізації: Для покращення вашого досвіду на платформі, включаючи рекомендації та налаштування.</p>
    <p className="lead">- Аналітики: Для збору статистичних даних про використання платформи та покращення наших послуг.</p>
    <h1 className="mt-5">3. Як ми захищаємо вашу інформацію</h1>
    <p className="lead">Ми вживаємо відповідних заходів для захисту вашої інформації від несанкціонованого доступу, використання або розголошення. Це включає:</p>
    <p className="lead">- Використання шифрування для захисту даних під час передачі.</p>
    <p className="lead">- Зберігання даних на захищених серверах з обмеженим доступом.</p>
    <p className="lead">- Регулярні перевірки безпеки та оновлення програмного забезпечення.</p>
    <h1 className="mt-5">4. Ваші права</h1>
    <p className="lead">Ви маєте право:</p>
    <p className="lead">- Запитувати доступ до своїх персональних даних.</p>
    <p className="lead">- Виправляти неточності у своїх даних.</p>
    <p className="lead">- Видаляти свої дані за певних умов.</p>
    <p className="lead">- Обмежувати обробку своїх даних.</p>
    <p className="lead">- Відкликати свою згоду на обробку даних.</p>
    <h1 className="mt-5">5. Зміни до цієї Політики</h1>
    <p className="lead">Ми можемо час від часу оновлювати цю Політику конфіденційності. Усі зміни будуть опубліковані на цій сторінці, і ми рекомендуємо вам регулярно перевіряти цю сторінку на предмет змін.</p>
    <h1 className="mt-5">6. Контактна інформація</h1>
    <p className="lead">Якщо у вас є питання щодо цієї Політики конфіденційності, зв'яжіться з нами за адресою: cathouse7565@gmail.com</p>
  </div>
</main>
          <Footer />
        </div>
    );
};

export default PrivacyPolicy;